<?xml version="1.0" ?>
<net name="vino_cnn1d" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="22880,50,1"/>
			<output>
				<port id="0" precision="FP32">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1d/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv1d/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv1d/conv1d/ExpandDims/Transpose/Cast_12003_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1d/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1d/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="128,1,1,4" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1d/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,1" pads_end="0,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv1d/conv1d/Transpose/Cast_12005_const" type="Const" version="opset1">
			<data element_type="i64" offset="2088" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv1d/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv1d/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv1d/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv1d/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2120" shape="1,1,128" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv1d/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv1d/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="max_pooling1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="2632" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="max_pooling1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="max_pooling1d/ExpandDims/Transpose/Cast_12001_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="max_pooling1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="max_pooling1d/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2,1" pads_begin="0,0" pads_end="0,0" strides="2,1"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>25</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="max_pooling1d/MaxPool/Transpose/Cast_11997_const" type="Const" version="opset1">
			<data element_type="i64" offset="2088" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="max_pooling1d/MaxPool/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>25</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="max_pooling1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="2632" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="max_pooling1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv1d_1/conv1d/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv1d_1/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv1d_1/conv1d/ExpandDims/Transpose/Cast_11999_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv1d_1/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv1d_1/conv1d/ExpandDims_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2640" shape="128,128,1,4" size="262144"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv1d_1/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,1" pads_end="0,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv1d_1/conv1d/Transpose/Cast_11993_const" type="Const" version="opset1">
			<data element_type="i64" offset="2088" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv1d_1/conv1d/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv1d_1/conv1d/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv1d_1/conv1d/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>1</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv1d_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="264784" shape="1,1,128" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv1d_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv1d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="max_pooling1d_1/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="2632" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="max_pooling1d_1/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="max_pooling1d_1/ExpandDims/Transpose/Cast_11991_const" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="max_pooling1d_1/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>25</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>25</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="max_pooling1d_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2,1" pads_begin="0,0" pads_end="1,0" strides="2,1"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>25</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="max_pooling1d_1/MaxPool/Transpose/Cast_11995_const" type="Const" version="opset1">
			<data element_type="i64" offset="2088" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="max_pooling1d_1/MaxPool/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>13</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="max_pooling1d_1/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="2632" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="max_pooling1d_1/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>13</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>13</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="flatten/Reshape/Cast_11989_const" type="Const" version="opset1">
			<data element_type="i64" offset="265296" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>13</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>1664</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="FC1_layer/MatMul/1_port_transpose1465_const" type="Const" version="opset1">
			<data element_type="f32" offset="265312" shape="128,1664" size="851968"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1664</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="FC1_layer/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>1664</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1664</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="FC1_layer/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1117280" shape="1,128" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="FC1_layer/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="FC1_layer/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="FC2_layer/MatMul/1_port_transpose1473_const" type="Const" version="opset1">
			<data element_type="f32" offset="1117792" shape="128,128" size="65536"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="FC2_layer/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="FC2_layer/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1183328" shape="1,128" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="FC2_layer/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="FC2_layer/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="top_level_output/MatMul/1_port_transpose1469_const" type="Const" version="opset1">
			<data element_type="f32" offset="1183840" shape="2,128" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="top_level_output/MatMul" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="top_level_output/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1184864" shape="1,2" size="8"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="top_level_output/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>22880</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="top_level_output/Softmax" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>22880</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="top_level_output/Softmax/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>22880</dim>
					<dim>2</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="34" to-port="1"/>
		<edge from-layer="34" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="37" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="39" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="39" to-port="1"/>
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="42" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="42" to-port="1"/>
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="44" to-port="1"/>
		<edge from-layer="44" from-port="2" to-layer="46" to-port="0"/>
		<edge from-layer="45" from-port="1" to-layer="46" to-port="1"/>
		<edge from-layer="46" from-port="2" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="49" from-port="1" to-layer="50" to-port="1"/>
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="1" to-layer="53" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="53" to-port="1"/>
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="55" to-port="1"/>
		<edge from-layer="55" from-port="2" to-layer="56" to-port="0"/>
		<edge from-layer="56" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="58" to-port="1"/>
		<edge from-layer="58" from-port="2" to-layer="60" to-port="0"/>
		<edge from-layer="59" from-port="1" to-layer="60" to-port="1"/>
		<edge from-layer="60" from-port="2" to-layer="61" to-port="0"/>
		<edge from-layer="61" from-port="1" to-layer="62" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value=""/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input_model value="DIR/vino_cnn1d.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[22880,50,1]"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="vino_cnn1d"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[22880    50     1]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
