{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 171, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}], "input_layers": [["input_1", 0, 0]], "output_layers": []}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}